src/cf/InformationRegisters/КотировкиЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КотировкиЦБ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаЗакрытия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КодЦБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/ЗагрузкаДанных/Ext/Module.bsl
Процедура ЗагрузитьИзФайла(ИмяФайла) Экспорт
	
    ФайлДанных = Новый ТекстовыйДокумент;
	
	ФайлДанных.Прочитать(ИмяФайла);
	
	КоличествоСтрок = ФайлДанных.КоличествоСтрок()-2;
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Период");
	ТЗ.Колонки.Добавить("КодЦБ");
	ТЗ.Колонки.Добавить("ЦенаЗакрытия");
	Для СчСтрок = 4 По КоличествоСтрок Цикл
		СтрокаДанных = ФайлДанных.ПолучитьСтроку(СчСтрок);
		СтрокаДанныхМассив = СтрРазделить(СтрокаДанных,";",Истина);
		Если ЗначениеЗаполнено(СтрокаДанныхМассив[7]) Тогда
			Попытка
				СтрокаТЗ = ТЗ.Добавить();
				СтрокаТЗ.Период = Дата(СтрЗаменить(СтрокаДанныхМассив[1],"-",""));
				СтрокаТЗ.КодЦБ = СтрокаДанныхМассив[0];
				СтрокаТЗ.ЦенаЗакрытия = СтрокаДанныхМассив[7]; 
			Исключение
			КонецПопытки;			
		КонецЕсли;			
	КонецЦикла;
	
	//Если ТЗ.Количество() Тогда
	//	НаборЗаписей = РегистрыСведений.КотировкиЦБ.СоздатьНаборЗаписей();
	//	НаборЗаписей.Загрузить(ТЗ);
	//	НаборЗаписей.Записать();
	//КонецЕсли;	
	Для каждого Строка Из ТЗ Цикл
		МенеджерЗаписи  = РегистрыСведений.КотировкиЦБ.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Строка);
		МенеджерЗаписи.Записать();
	КонецЦикла;                                      
КонецПроцедуры
